In [4]:
import pandas as pd

# Data Frame - list
df = pd.DataFrame([ ['Celine', 'France', 90, 80, 100],
                    ['James', 'UK', 80, 100, 90],
                    ['Jason', 'USA', 20, 100, 100],
                    ['Hans', 'Germany', 40, 60, 30]])
# Data Franme
df

        0        1   2    3    4
0  Celine   France  90   80  100
1   James       UK  80  100   90
2   Jason      USA  20  100  100
3    Hans  Germany  40   60   30

In [3]:
# Column
df[0]

0    Celine
1     James
2     Jason
3      Hans
Name: 0, dtype: object

In [9]:
# Row - name
print(df.loc[1])

# Row - index
df.loc[1]

0    James
1       UK
2       80
3      100
4       90
Name: 1, dtype: object

0    James
1       UK
2       80
3      100
4       90
Name: 1, dtype: object

In [10]:
# Data Frame - Dictionary
df2 = pd.DataFrame({'name'      :['Celine', 'James', 'Jason', 'Hans'],
                    'nation'    :['France', 'UK', 'USA', 'Germany'],
                    'math'      :[90, 80, 20, 40],
                    'english'   :[80,90,100,60],
                    'science'   :[100,90,100,30]})

# Data Frame
df2

     name   nation  math  english  science
0  Celine   France    90       80      100
1   James       UK    80       90       90
2   Jason      USA    20      100      100
3    Hans  Germany    40       60       30

In [17]:
# Column - name
df2['name']

0    Celine
1     James
2     Jason
3      Hans
Name: name, dtype: object

In [18]:
# Row - name
print(df2.loc[1])

# Row - index
df2.loc[1]

name       James
nation        UK
math          80
english       90
science       90
Name: 1, dtype: object

name       James
nation        UK
math          80
english       90
science       90
Name: 1, dtype: object

In [28]:
# Data Frame - Dictionary, index
df3 = pd.DataFrame({'nation':['France', 'UK', 'USA', 'Germany'],
                    'grade' :[90, 80, 20, 40],
                    'math'      :[90, 80, 20, 40],
                    'english'   :[80,90,100,60],
                    'science'   :[100,90,100,30]})
df3.index = ['Celine', 'James', 'Jsaon', 'Hans']

# Data Frame
df3

         nation  grade  math  english  science
Celine   France     90    90       80      100
James        UK     80    80       90       90
Jsaon       USA     20    20      100      100
Hans    Germany     40    40       60       30

In [22]:
# Column - name
df3['nation']

Celine     France
James          UK
Jsaon         USA
Hans      Germany
Name: nation, dtype: object

In [25]:
# row - index
print(df3.iloc[0])

# row - key
df3.loc['Celine']

nation    France
grade         90
Name: Celine, dtype: object

nation    France
grade         90
Name: Celine, dtype: object

In [33]:
# 집계 함수
sum(df2['math'])
sum(df2['math']) / len(df2)

57.5

In [34]:
# 전체 데이터 평균
df2.mean()

C:\Users\gik_k\AppData\Local\Temp\ipykernel_22600\3587575296.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df2.mean()

math       57.5
english    82.5
science    80.0
dtype: float64

In [35]:
# 전체 데이터 설명
df2.describe()

            math     english     science
count   4.000000    4.000000    4.000000
mean   57.500000   82.500000   80.000000
std    33.040379   17.078251   33.665016
min    20.000000   60.000000   30.000000
25%    35.000000   75.000000   75.000000
50%    60.000000   85.000000   95.000000
75%    82.500000   92.500000  100.000000
max    90.000000  100.000000  100.000000

In [40]:
# Excel 데이터 적재
# conda install -c anaconda xlrd
df_titanic = pd.read_excel('titanic.xls')
df_titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [43]:
# 데이터 개수
len(df_titanic)

1309

In [52]:
# 남성 숫자
len(df_titanic.loc[df_titanic['sex'] == 'male']) / len(df_titanic)

0.6440030557677616

In [46]:
df_titanic.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413500,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000